Reports/СпискиПерсональногоВоинскогоУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Report>
		<Properties>
			<Name>СпискиПерсональногоВоинскогоУчета</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/ДокументыФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ДокументыФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>21</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КемВыдан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЯвляетсяДокументомУдостоверяющимЛичность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФамилияЛатиницей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяЛатиницей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтранаВыдачи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Физлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ГруппыУчетаКарточкиВоинскогоУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ГруппыУчетаКарточкиВоинскогоУчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОфицерскийСостав</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РедовойСержантскийСтаршинскийСостав</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Женщины</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Призывники</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ОтношениеКВоинскомуУчету.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ОтношениеКВоинскомуУчету</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Состоит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Встает</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеСостоит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятПоВозрасту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятПоСостояниюЗдоровья</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПризванНаВоинскуюСлужбу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СлужбаПоКонтракту</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ОбразованиеФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>ОбразованиеФизическихЛиц</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ФизическиеЛица</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОбразования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОбразованияФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПослевузовскогоОбразования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОбразованияФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчебноеЗаведение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчебныеЗаведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Специальность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСпециальностейПоОбразованию</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовОбОбразовании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Квалификация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Начало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Окончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеКурса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДополнительногоОбучения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПрофессиональнойПодготовки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДокументОснование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеОбразование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОбучения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/РодственникиФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>РодственникиФизическихЛиц</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ФизическиеЛица</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтепеньРодства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтепениРодстваФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаИждивении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСлужебное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ВидыДокументовФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>ВидыДокументовФизическихЛиц</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/СоставыВоеннослужащих.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>СоставыВоеннослужащих</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОфицерскийСостав</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/СпискиПерсональногоВоинскогоУчета/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ИнициализироватьОтчет(); 
	
	СтандартнаяОбработка = Ложь;
	
	НастройкиОтчета = ЭтотОбъект.КомпоновщикНастроек.ПолучитьНастройки();				   

	ДокументРезультат.Очистить();
	
	ДокументРезультат.ТолькоПросмотр = Истина;
	ДокументРезультат.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СпискиПерсональногоВоинскогоУчета";
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	ДатаОтчета = '00010101';
	
	УстановитьДатуОтчета(НастройкиОтчета, ДатаОтчета);   
	
	ДанныеОтчета = Новый ДеревоЗначений;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(ЭтотОбъект.СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки,, Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	//СоответствиеПользовательскихПолей = ЗарплатаКадрыОтчеты.СоответствиеПользовательскихПолей(НастройкиОтчета);
	// Создадим и инициализируем процессор компоновки.
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ДанныеОтчета);
	
	// Обозначим начало вывода
	ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);
	
	ФормаОтчета = НастройкиОтчета.ПараметрыДанных.Элементы.Найти("ФормаОтчета").Значение;  
	ПараметрВыводитьОтветственных = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВыводитьОтветственных")).Значение;
	ДатаФормирования = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДатаФормирования")).Значение;	
	Если ФормаОтчета = "Форма916" Тогда   
		ВывестиМакетСпискиПерсональногоВоинскогоУчета_916(ДокументРезультат, ДанныеОтчета, ДатаФормирования.Дата, ПараметрВыводитьОтветственных);
	Иначе	
		ВывестиМакетСпискиПерсональногоВоинскогоУчета(ДокументРезультат, ДанныеОтчета, ДатаФормирования.Дата, ПараметрВыводитьОтветственных);   
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура ИнициализироватьОтчет() Экспорт
	
	ЗарплатаКадрыОбщиеНаборыДанных.ЗаполнитьОбщиеИсточникиДанныхОтчета(ЭтотОбъект); 
	
	НастройкиОтчета = ЭтотОбъект.КомпоновщикНастроек.ПолучитьНастройки();				   
	
КонецПроцедуры

// Для общей формы "Форма отчета" подсистемы "Варианты отчетов".
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
	Настройки.События.ПриСозданииНаСервере = Истина;
	
КонецПроцедуры

// Вызывается в обработчике одноименного события формы отчета после выполнения кода формы.
//
// Параметры:
//   Форма - УправляемаяФорма - Форма отчета.
//   Отказ - Передается из параметров обработчика "как есть".
//   СтандартнаяОбработка - Передается из параметров обработчика "как есть".
//
// См. также:
//   "УправляемаяФорма.ПриСозданииНаСервере" в синтакс-помощнике.
//
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	ИнициализироватьОтчет();
    ЗначениеВДанныеФормы(ЭтотОбъект, Форма.Отчет);
	
КонецПроцедуры

Процедура УстановитьДатуОтчета(НастройкиОтчета, ДатаОтчета)
	
	ЗначениеПараметраПериод = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
	
	Если ЗначениеПараметраПериод <> Неопределено Тогда
		
		УстановитьДатуОтчета = Ложь;
		
		Если ТипЗнч(ЗначениеПараметраПериод.Значение) = Тип("Неопределено") Тогда
			УстановитьДатуОтчета = Истина;
		КонецЕсли;
		
		Если ТипЗнч(ЗначениеПараметраПериод.Значение) = Тип("Дата")
			И ЗначениеПараметраПериод.Значение = '00010101' Тогда
			УстановитьДатуОтчета = Истина;
		КонецЕсли; 
		
		Если ТипЗнч(ЗначениеПараметраПериод.Значение) = Тип("СтандартнаяДатаНачала")
			И Дата(ЗначениеПараметраПериод.Значение) = '00010101' Тогда
			УстановитьДатуОтчета = Истина;
		КонецЕсли; 
		
		Если УстановитьДатуОтчета Тогда
			ЗначениеПараметраПериод.Значение = ТекущаяДатаСеанса();
		КонецЕсли; 
		
		ДатаОтчета = Дата(ЗначениеПараметраПериод.Значение);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВывестиМакетСпискиПерсональногоВоинскогоУчета(ДокументРезультат, ДанныеОтчета, ДатаОтчета, ВыводитьОтветственных)
	
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	Макет 		  = УправлениеПечатью.МакетПечатнойФормы("Отчет.СпискиПерсональногоВоинскогоУчета.ПФ_MXL_UK_СпискиПерсональногоВоинскогоУчета");
	Заголовок 	  = Макет.ПолучитьОбласть("Заголовок");
	СтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы"); 
	Подвал 		  = Макет.ПолучитьОбласть("Подвал");

	ВыводимыеОбласти = Новый Массив;
	ВыводимыеОбласти.Добавить(СтрокаТаблицы);
	ВыводимыеОбласти.Добавить(Подвал);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ТаблицаФизическихЛиц = Новый ТаблицаЗначений;
	ТаблицаФизическихЛиц.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	
	Для Каждого ДанныеОрганизации Из ДанныеОтчета.Строки Цикл
		Для Каждого ДанныеСотрудников Из ДанныеОрганизации.Строки Цикл 
			НоваяСтрокаТаблицыСотрудников = ТаблицаФизическихЛиц.Добавить();
			НоваяСтрокаТаблицыСотрудников.ФизическоеЛицо = ДанныеСотрудников.ФизическоеЛицо;
		КонецЦикла;	
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ТаблицаФизическихЛиц", ТаблицаФизическихЛиц); 
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТаблицаФизическихЛиц.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ВТФизическиеЛица
		|ИЗ
		|	&ТаблицаФизическихЛиц КАК ТаблицаФизическихЛиц";
	
	Запрос.Выполнить();
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ФизическиеЛицаОбразование.Владелец КАК ФизическоеЛицо,
		|	ФизическиеЛицаОбразование.Ссылка,
		|	ФизическиеЛицаОбразование.ВидОбразования,
		|	ФизическиеЛицаОбразование.Специальность,
		|	ФизическиеЛицаОбразование.ВидДокумента,
		|	ФизическиеЛицаОбразование.Серия,
		|	ФизическиеЛицаОбразование.Номер,
		|	ФизическиеЛицаОбразование.ОсновноеОбразование КАК ОсновноеОбразование,
		|	ФизическиеЛицаОбразование.ВидПослевузовскогоОбразования,
		|	ФизическиеЛицаОбразование.ВидДополнительногоОбучения
		|ИЗ
		|	Справочник.ОбразованиеФизическихЛиц КАК ФизическиеЛицаОбразование
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТФизическиеЛица КАК ТаблицаОтборовФизическихЛиц
		|		ПО ФизическиеЛицаОбразование.Владелец = ТаблицаОтборовФизическихЛиц.ФизическоеЛицо
		|ГДЕ
		|	ФизическиеЛицаОбразование.ОсновноеОбразование = ИСТИНА";
	ОбразованияФизическихЛиц = Запрос.Выполнить().Выбрать();  
	
	
	Запрос.Текст = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РодственникиФизическихЛиц.Владелец КАК ФизическоеЛицо,
		|	РодственникиФизическихЛиц.СтепеньРодства КАК СтепеньРодства,
		|	РодственникиФизическихЛиц.Наименование КАК ФИОРодственника,
		|	РодственникиФизическихЛиц.ДатаРождения КАК ДатаРожденияРодственника
		|ИЗ
		|	Справочник.РодственникиФизическихЛиц КАК РодственникиФизическихЛиц
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТФизическиеЛица КАК ТаблицаОтборовФизическихЛиц
		|		ПО РодственникиФизическихЛиц.Владелец = ТаблицаОтборовФизическихЛиц.ФизическоеЛицо
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФизическоеЛицо,
		|	РодственникиФизическихЛиц.ДатаРождения УБЫВ
		|";
	РодственникиФизическихЛиц = Запрос.Выполнить().Выбрать();     
	
	СписокПаспортов = Новый Массив;
   	СписокПаспортов.Добавить(Справочники.ВидыДокументовФизическихЛиц.Паспорт);
   	СписокПаспортов.Добавить(Справочники.ВидыДокументовФизическихЛиц.Загранпаспорт);
	
	Запрос.УстановитьПараметр("СписокПаспортов", СписокПаспортов); 
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДокументыФизическихЛицСрезПоследних.Физлицо КАК ФизическоеЛицо,     
	|	ДокументыФизическихЛицСрезПоследних.ВидДокумента КАК ДокументВид,
	|	ДокументыФизическихЛицСрезПоследних.Серия КАК Серия,
	|	ДокументыФизическихЛицСрезПоследних.Номер КАК Номер,
	|	ДокументыФизическихЛицСрезПоследних.ДатаВыдачи КАК ДатаВыдачи,
	|	ДокументыФизическихЛицСрезПоследних.КемВыдан КАК КемВыдан
	|ИЗ
	|	РегистрСведений.ДокументыФизическихЛиц.СрезПоследних(
	|			,
	|			ВидДокумента В (&СписокПаспортов)
	|				И Физлицо В
	|					(ВЫБРАТЬ
	|						ТаблицаОтборовФизическихЛиц.ФизическоеЛицо КАК ФизическоеЛицо
	|					ИЗ
	|						ВТФизическиеЛица КАК ТаблицаОтборовФизическихЛиц)) КАК ДокументыФизическихЛицСрезПоследних";  
	ДокументыФизическихЛиц = Запрос.Выполнить().Выбрать();

	Для Каждого ДанныеОрганизации Из ДанныеОтчета.Строки Цикл  
		
		Если ДокументРезультат.ВысотаТаблицы > 0 Тогда
			ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПараметрыЗаголовка = ПараметрыЗаголовкаСтруктура(ДатаОтчета, ДанныеОрганизации.Организация);
		
		ЗаполнитьЗначенияСвойств(Заголовок.Параметры, ПараметрыЗаголовка);
		ЗаполнитьЗначенияСвойств(Подвал.Параметры, ПараметрыЗаголовка);
		
		Заголовок.Параметры.ПолноеНаименованиеОрганизации = ?(ЗначениеЗаполнено(ПараметрыЗаголовка.НаименованиеПолное), ПараметрыЗаголовка.НаименованиеПолное, ПараметрыЗаголовка.Наименование);

		ДокументРезультат.Вывести(Заголовок);
		Для Каждого ДанныеСотрудников Из ДанныеОрганизации.Строки Цикл 
					
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы.Параметры, ДанныеСотрудников);    
			ДатаРегистратора = Формат(ДанныеСотрудников.ДатаРегистратора,"ДФ=dd.MM.yyyy");  
			
			Если ЗначениеЗаполнено(ДанныеСотрудников.КодПоДРФО) И ЗначениеЗаполнено(ДанныеСотрудников.НомерЗаписиВРеестреВоеннообязанных) Тогда  
				СтрокаТаблицы.Параметры.НомерЗаписиВРеестреВоеннообязанных = ДанныеСотрудников.НомерЗаписиВРеестреВоеннообязанных + "/" + ДанныеСотрудников.КодПоДРФО
			Иначе 
				СтрокаТаблицы.Параметры.НомерЗаписиВРеестреВоеннообязанных = ?(ЗначениеЗаполнено(ДанныеСотрудников.КодПоДРФО),ДанныеСотрудников.КодПоДРФО, ДанныеСотрудников.НомерЗаписиВРеестреВоеннообязанных ) 
			КонецЕсли;      
			
			Если ЗначениеЗаполнено(ДанныеСотрудников.РегистраторДоУвольнения) Тогда    
				СтрокаТаблицы.Параметры.РеквизитыРегистратора = "Наказ № " + ДанныеСотрудников.НомерРегистратораДоУвольнения + " від " + Формат(ДанныеСотрудников.ДатаРегистратораДоУвольнения,"ДФ=dd.MM.yyyy") + "/" + Символы.ПС + Символы.ПС +
				"Наказ про звільнення № " + ДанныеСотрудников.НомерРегистратора + " від " + ДатаРегистратора;
			Иначе	
				СтрокаТаблицы.Параметры.РеквизитыРегистратора = "Наказ № " + ДанныеСотрудников.НомерРегистратора + " від " + ДатаРегистратора;
			КонецЕсли; 
			
			СтрокаТаблицы.Параметры.РеквизитыСообщения = "";
			Если ЗначениеЗаполнено(ДанныеСотрудников.НомерСообщенияДоУвольнения) И ЗначениеЗаполнено(ДанныеСотрудников.ДатаСообщенияДоУвольнения) И
				ЗначениеЗаполнено(ДанныеСотрудников.НомерСообщения) И ЗначениеЗаполнено(ДанныеСотрудников.ДатаСообщения) Тогда
				СтрокаТаблицы.Параметры.РеквизитыСообщения = "Повідомлення № " + ДанныеСотрудников.НомерСообщенияДоУвольнения + " від " + Формат(ДанныеСотрудников.ДатаСообщенияДоУвольнения,"ДФ=dd.MM.yyyy") + "/" + Символы.ПС + Символы.ПС +
				"Повідомлення про звільнення № " + ДанныеСотрудников.НомерСообщения + " від " + Формат(ДанныеСотрудников.ДатаСообщения, "ДФ=dd.MM.yyyy");  
			ИначеЕсли ЗначениеЗаполнено(ДанныеСотрудников.НомерСообщенияДоУвольнения) И ЗначениеЗаполнено(ДанныеСотрудников.ДатаСообщенияДоУвольнения) И
				Не ЗначениеЗаполнено(ДанныеСотрудников.НомерСообщения) И  Не ЗначениеЗаполнено(ДанныеСотрудников.ДатаСообщения) Тогда
				СтрокаТаблицы.Параметры.РеквизитыСообщения = "Повідомлення № " + ДанныеСотрудников.НомерСообщенияДоУвольнения + " від " + Формат(ДанныеСотрудников.ДатаСообщенияДоУвольнения,"ДФ=dd.MM.yyyy");
			ИначеЕсли ЗначениеЗаполнено(ДанныеСотрудников.НомерСообщения) И ЗначениеЗаполнено(ДанныеСотрудников.ДатаСообщения) Тогда 
				Если ТипЗнч(ДанныеСотрудников.Регистратор) = Тип("ДокументСсылка.Увольнение") ИЛИ ТипЗнч(ДанныеСотрудников.Регистратор) = Тип("ДокументСсылка.УвольнениеСписком") Тогда
					СтрокаТаблицы.Параметры.РеквизитыСообщения = "Повідомлення про звільнення  № " + ДанныеСотрудников.НомерСообщения + " від " + Формат(ДанныеСотрудников.ДатаСообщения,"ДФ=dd.MM.yyyy")			
				Иначе  
					СтрокаТаблицы.Параметры.РеквизитыСообщения = "Повідомлення № " + ДанныеСотрудников.НомерСообщения + " від " + Формат(ДанныеСотрудников.ДатаСообщения,"ДФ=dd.MM.yyyy")			
				КонецЕсли	
			КонецЕсли;
			
			Отбор = Новый Структура;         
			Отбор.Вставить("ФизическоеЛицо", ДанныеСотрудников.ФизическоеЛицо); 
			
			ТекстСоставСемьи = ""; 
			ТекстОбразование = "";  
			ТекстДокументы = "";
			
			РодственникиФизическихЛиц.Сбросить();    
            Если ЗначениеЗаполнено(ДанныеСотрудников.СостояниеВБраке) Тогда
				ТекстСоставСемьи = Строка(ДанныеСотрудников.СостояниеВБраке)
			КонецЕсли;	
			Пока РодственникиФизическихЛиц.НайтиСледующий(Отбор, "ФизическоеЛицо") Цикл 
            	ТекстСоставСемьи = ТекстСоставСемьи + Символы.ПС + Символы.ПС +  РодственникиФизическихЛиц.ФИОРодственника + ?(ЗначениеЗаполнено(РодственникиФизическихЛиц.ДатаРожденияРодственника),", ","") 
				+ Формат(РодственникиФизическихЛиц.ДатаРожденияРодственника, "ДФ=dd.MM.yyyy"); 
			КонецЦикла;          
			СтрокаТаблицы.Параметры.ТекстСоставСемьи = ТекстСоставСемьи;     
			
			ОбразованияФизическихЛиц.Сбросить();
			Пока ОбразованияФизическихЛиц.НайтиСледующий(Отбор, "ФизическоеЛицо") Цикл                  
				ТекстДокумент = "";
				ТекстДокумент = Строка(ОбразованияФизическихЛиц.ВидДокумента) + " " + ОбразованияФизическихЛиц.Серия + " " + ОбразованияФизическихЛиц.Номер;
            	ТекстОбразование = ТекстОбразование + Символы.ПС + Символы.ПС + Строка(ОбразованияФизическихЛиц.ВидОбразования) +  
				?(ЗначениеЗаполнено(ОбразованияФизическихЛиц.Специальность), ", ", "") + ОбразованияФизическихЛиц.Специальность + ?(СокрЛП(ТекстДокумент) = "","", ", ") +
				ТекстДокумент;
			КонецЦикла;    
			СтрокаТаблицы.Параметры.ТекстОбразование = ТекстОбразование; 
			
			ДокументыФизическихЛиц.Сбросить(); 
			Отбор.Вставить("ДокументВид", Справочники.ВидыДокументовФизическихЛиц.Паспорт);    
			Если ДокументыФизическихЛиц.НайтиСледующий(Отбор, "ФизическоеЛицо, ДокументВид") Тогда 
				ТекстДокументы = Строка(ДокументыФизическихЛиц.ДокументВид) + " " + ДокументыФизическихЛиц.Серия + " " + ДокументыФизическихЛиц.Номер +
				?(СокрЛП(ДокументыФизическихЛиц.КемВыдан) = "", "", ", ") + ДокументыФизическихЛиц.КемВыдан + ?(СокрЛП(ДокументыФизическихЛиц.ДатаВыдачи) = "", "", ", ") +
				Формат(ДокументыФизическихЛиц.ДатаВыдачи,"ДФ=dd.MM.yyyy");
			КонецЕсли;	
			
			ДокументыФизическихЛиц.Сбросить();  
			Отбор.Удалить("ДокументВид");
			Отбор.Вставить("ДокументВид", Справочники.ВидыДокументовФизическихЛиц.Загранпаспорт);
			
			Если ДокументыФизическихЛиц.НайтиСледующий(Отбор, "ФизическоеЛицо, ДокументВид") Тогда 
            	ТекстДокументы = ТекстДокументы + Символы.ПС + Символы.ПС +  Строка(ДокументыФизическихЛиц.ДокументВид) + " " + ДокументыФизическихЛиц.Серия + " " + ДокументыФизическихЛиц.Номер +
				?(СокрЛП(ДокументыФизическихЛиц.КемВыдан) = "", "", ", ") + ДокументыФизическихЛиц.КемВыдан + ?(СокрЛП(ДокументыФизическихЛиц.ДатаВыдачи) = "", "", ", ") +
				Формат(ДокументыФизическихЛиц.ДатаВыдачи, "ДФ=dd.MM.yyyy");
			КонецЕсли;
			СтрокаТаблицы.Параметры.ТекстДокументы = ТекстДокументы; 
			
			ДокументРезультат.Вывести(СтрокаТаблицы);

		КонецЦикла; 
		Если ВыводитьОтветственных Тогда 
			ДокументРезультат.Вывести(Подвал);
		КонецЕсли;	 
		ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЦикла;
	
КонецПроцедуры

Процедура ВывестиМакетСпискиПерсональногоВоинскогоУчета_916(ДокументРезультат, ДанныеОтчета, ДатаОтчета, ВыводитьОтветственных)
	
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	Макет 		  = УправлениеПечатью.МакетПечатнойФормы("Отчет.СпискиПерсональногоВоинскогоУчета.ПФ_MXL_UK_СпискиПерсональногоВоинскогоУчета_916");
	Заголовок 	  = Макет.ПолучитьОбласть("Заголовок");
	СтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы"); 
	Подвал 		  = Макет.ПолучитьОбласть("Подвал");
	
	ВыводимыеОбласти = Новый Массив;
	ВыводимыеОбласти.Добавить(СтрокаТаблицы);
	ВыводимыеОбласти.Добавить(Подвал);

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ТаблицаФизическихЛиц = Новый ТаблицаЗначений;
	ТаблицаФизическихЛиц.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	
	Для Каждого ДанныеОрганизации Из ДанныеОтчета.Строки Цикл
		Для Каждого ДанныеСотрудников Из ДанныеОрганизации.Строки Цикл 
			НоваяСтрокаТаблицыСотрудников = ТаблицаФизическихЛиц.Добавить();
			НоваяСтрокаТаблицыСотрудников.ФизическоеЛицо = ДанныеСотрудников.ФизическоеЛицо;
		КонецЦикла;	
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ТаблицаФизическихЛиц", ТаблицаФизическихЛиц); 
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТаблицаФизическихЛиц.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ВТФизическиеЛица
		|ИЗ
		|	&ТаблицаФизическихЛиц КАК ТаблицаФизическихЛиц";
	
	Запрос.Выполнить();
		
	СписокПаспортов = Новый Массив;
   	СписокПаспортов.Добавить(Справочники.ВидыДокументовФизическихЛиц.Паспорт);
	
	Запрос.УстановитьПараметр("СписокПаспортов", СписокПаспортов); 
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДокументыФизическихЛицСрезПоследних.Физлицо КАК ФизическоеЛицо,     
	|	ДокументыФизическихЛицСрезПоследних.ВидДокумента КАК ДокументВид,
	|	ДокументыФизическихЛицСрезПоследних.Серия КАК Серия,
	|	ДокументыФизическихЛицСрезПоследних.Номер КАК Номер,
	|	ДокументыФизическихЛицСрезПоследних.ДатаВыдачи КАК ДатаВыдачи,
	|	ДокументыФизическихЛицСрезПоследних.КемВыдан КАК КемВыдан
	|ИЗ
	|	РегистрСведений.ДокументыФизическихЛиц.СрезПоследних(
	|			,
	|			ВидДокумента В (&СписокПаспортов)
	|				И Физлицо В
	|					(ВЫБРАТЬ
	|						ТаблицаОтборовФизическихЛиц.ФизическоеЛицо КАК ФизическоеЛицо
	|					ИЗ
	|						ВТФизическиеЛица КАК ТаблицаОтборовФизическихЛиц)) КАК ДокументыФизическихЛицСрезПоследних";  
	ДокументыФизическихЛиц = Запрос.Выполнить().Выбрать();

	Для Каждого ДанныеОрганизации Из ДанныеОтчета.Строки Цикл
		
		Если ДокументРезультат.ВысотаТаблицы > 0 Тогда
			ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ПараметрыЗаголовка = ПараметрыЗаголовкаСтруктура(ДатаОтчета, ДанныеОрганизации.Организация);
		
		ЗаполнитьЗначенияСвойств(Заголовок.Параметры, ПараметрыЗаголовка);
		ЗаполнитьЗначенияСвойств(Подвал.Параметры, ПараметрыЗаголовка);
		
		Заголовок.Параметры.ПолноеНаименованиеОрганизации = ?(ЗначениеЗаполнено(ПараметрыЗаголовка.НаименованиеПолное), ПараметрыЗаголовка.НаименованиеПолное, ПараметрыЗаголовка.Наименование);
		
		ДокументРезультат.Вывести(Заголовок);
       	КоличествоСтрок = ДанныеОрганизации.Строки.Количество();

		Для Каждого ДанныеСотрудников Из ДанныеОрганизации.Строки Цикл 
					
			Если ДанныеСотрудников.СистемныеПоляНомерПоПорядкуВГруппировке < КоличествоСтрок 
				И Не ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ДокументРезультат, СтрокаТаблицы) Тогда
				ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
			ИначеЕсли ДанныеСотрудников.СистемныеПоляНомерПоПорядкуВГруппировке = КоличествоСтрок
				И Не ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ВыводимыеОбласти) Тогда
				ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли; 
			
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы.Параметры, ДанныеСотрудников);    
			ДатаРегистратора = Формат(ДанныеСотрудников.ДатаРегистратора,"ДФ=dd.MM.yyyy");  
			
			СтрокаТаблицы.Параметры.Звание = ?(ДанныеСотрудников.Звание = "Призовник","",ДанныеСотрудников.Звание);
			
			Если ЗначениеЗаполнено(ДанныеСотрудников.ВУС) И (ДанныеСотрудников.ГруппаУчетаКарточкиВоинскогоУчета = Перечисления.ГруппыУчетаКарточкиВоинскогоУчета.РедовойСержантскийСтаршинскийСостав 
				Или (ДанныеСотрудников.ГруппаУчетаКарточкиВоинскогоУчета = Перечисления.ГруппыУчетаКарточкиВоинскогоУчета.Женщины
					И (ДанныеСотрудников.Состав = Справочники.СоставыВоеннослужащих.СержантскийИСтаршинский 
					Или ДанныеСотрудников.Состав = Справочники.СоставыВоеннослужащих.Рядовой))) И Не ДанныеСотрудников.Звание = "Призовник" Тогда
				СтрокаТаблицы.Параметры.ВУС = Лев(СокрЛП(ДанныеСотрудников.ВУС),3) 	
  	        КонецЕсли;
			
			Если ЗначениеЗаполнено(ДанныеСотрудников.СрокОтсрочки) И ЗначениеЗаполнено(ДанныеСотрудников.ОснованиеОтсрочки)  Тогда
				СтрокаТаблицы.Параметры.СрокОтсрочки = "До "+ Формат(ДанныеСотрудников.СрокОтсрочки,"ДФ=dd.MM.yyyy") + ", ";
				СтрокаТаблицы.Параметры.ОснованиеОтсрочки = ДанныеСотрудников.ОснованиеОтсрочки;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ДанныеСотрудников.АдресУчета) Тогда
				СтрокаТаблицы.Параметры.Адрес = ДанныеСотрудников.АдресУчета	  
			ИначеЕсли ЗначениеЗаполнено(ДанныеСотрудников.АдресМестаПроживанияПредставление) Тогда 
				СтрокаТаблицы.Параметры.Адрес = ДанныеСотрудников.АдресМестаПроживанияПредставление	  
			Иначе	
				СтрокаТаблицы.Параметры.Адрес = ДанныеСотрудников.АдресПоПропискеПредставление	  
			КонецЕсли;
			
			СтрокаТаблицы.Параметры.ПроходитВоеннуюСлужбу = ?(ДанныеСотрудников.Звание = "Призовник","",ДанныеСотрудников.ПроходитВоеннуюСлужбу);
			Если Не ДанныеСотрудников.Звание = "Призовник" Тогда
				Если ДанныеСотрудников.НаличиеМобпредписания Тогда
					СтрокаТаблицы.Параметры.МобПредписание = "Так" + ?(ЗначениеЗаполнено(ДанныеСотрудников.ДатаВыдачиМобпредписания),", " + Формат(ДанныеСотрудников.ДатаВыдачиМобпредписания,"ДФ=dd.MM.yyyy"),"") +
					?(ЗначениеЗаполнено(ДанныеСотрудников.НомерКомандыПартии),", " + ДанныеСотрудников.НомерКомандыПартии,""); 
				Иначе
					СтрокаТаблицы.Параметры.МобПредписание = "Ні"
				КонецЕсли;
			Иначе	
			    СтрокаТаблицы.Параметры.МобПредписание = ""
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ДанныеСотрудников.РегистраторДоУвольнения) Тогда    
				СтрокаТаблицы.Параметры.РеквизитыРегистратора = "Наказ № " + ДанныеСотрудников.НомерРегистратораДоУвольнения + " від " + Формат(ДанныеСотрудников.ДатаРегистратораДоУвольнения,"ДФ=dd.MM.yyyy") + "/" + Символы.ПС + Символы.ПС +
				"Наказ про звільнення № " + ДанныеСотрудников.НомерРегистратора + " від " + ДатаРегистратора;
			Иначе	
				СтрокаТаблицы.Параметры.РеквизитыРегистратора = "Наказ № " + ДанныеСотрудников.НомерРегистратора + " від " + ДатаРегистратора;
			КонецЕсли; 
				
			СтрокаТаблицы.Параметры.РеквизитыСообщения = "";
			Если ЗначениеЗаполнено(ДанныеСотрудников.НомерСообщенияДоУвольнения) И ЗначениеЗаполнено(ДанныеСотрудников.ДатаСообщенияДоУвольнения) И
				ЗначениеЗаполнено(ДанныеСотрудников.НомерСообщения) И ЗначениеЗаполнено(ДанныеСотрудников.ДатаСообщения) Тогда
				СтрокаТаблицы.Параметры.РеквизитыСообщения = "Повідомлення № " + ДанныеСотрудников.НомерСообщенияДоУвольнения + " від " + Формат(ДанныеСотрудников.ДатаСообщенияДоУвольнения,"ДФ=dd.MM.yyyy") + "/" + Символы.ПС + Символы.ПС +
				"Повідомлення про звільнення № " + ДанныеСотрудников.НомерСообщения + " від " + Формат(ДанныеСотрудников.ДатаСообщения, "ДФ=dd.MM.yyyy");  
			ИначеЕсли ЗначениеЗаполнено(ДанныеСотрудников.НомерСообщенияДоУвольнения) И ЗначениеЗаполнено(ДанныеСотрудников.ДатаСообщенияДоУвольнения) И
				Не ЗначениеЗаполнено(ДанныеСотрудников.НомерСообщения) И  Не ЗначениеЗаполнено(ДанныеСотрудников.ДатаСообщения) Тогда
				СтрокаТаблицы.Параметры.РеквизитыСообщения = "Повідомлення № " + ДанныеСотрудников.НомерСообщенияДоУвольнения + " від " + Формат(ДанныеСотрудников.ДатаСообщенияДоУвольнения,"ДФ=dd.MM.yyyy");
			ИначеЕсли ЗначениеЗаполнено(ДанныеСотрудников.НомерСообщения) И ЗначениеЗаполнено(ДанныеСотрудников.ДатаСообщения) Тогда 
				Если ТипЗнч(ДанныеСотрудников.Регистратор) = Тип("ДокументСсылка.Увольнение") ИЛИ ТипЗнч(ДанныеСотрудников.Регистратор) = Тип("ДокументСсылка.УвольнениеСписком") Тогда
					СтрокаТаблицы.Параметры.РеквизитыСообщения = "Повідомлення про звільнення  № " + ДанныеСотрудников.НомерСообщения + " від " + Формат(ДанныеСотрудников.ДатаСообщения,"ДФ=dd.MM.yyyy")			
				Иначе  
					СтрокаТаблицы.Параметры.РеквизитыСообщения = "Повідомлення № " + ДанныеСотрудников.НомерСообщения + " від " + Формат(ДанныеСотрудников.ДатаСообщения,"ДФ=dd.MM.yyyy")			
				КонецЕсли	
			КонецЕсли;
			
			Отбор = Новый Структура;         
			Отбор.Вставить("ФизическоеЛицо", ДанныеСотрудников.ФизическоеЛицо); 
						
			ДокументыФизическихЛиц.Сбросить(); 
			Отбор.Вставить("ДокументВид", Справочники.ВидыДокументовФизическихЛиц.Паспорт);    
			Если ДокументыФизическихЛиц.НайтиСледующий(Отбор, "ФизическоеЛицо, ДокументВид") Тогда 
				Если ЗначениеЗаполнено(ДокументыФизическихЛиц.Серия) Тогда
					ТекстДокументы = Строка(ДокументыФизическихЛиц.ДокументВид) + " " + ДокументыФизическихЛиц.Серия + " " + ДокументыФизическихЛиц.Номер +
					?(СокрЛП(ДокументыФизическихЛиц.КемВыдан) = "", "", ", виданий ") + ДокументыФизическихЛиц.КемВыдан + ?(СокрЛП(ДокументыФизическихЛиц.ДатаВыдачи) = "", "", ", ") +
					Формат(ДокументыФизическихЛиц.ДатаВыдачи,"ДФ=dd.MM.yyyy"); 
				Иначе     
					ТекстДокументы = ДокументыФизическихЛиц.Номер + ?(СокрЛП(ДокументыФизическихЛиц.КемВыдан) = "", "", ", виданий ") + ДокументыФизическихЛиц.КемВыдан + 
					?(СокрЛП(ДокументыФизическихЛиц.ДатаВыдачи) = "", "", ", ") +
					Формат(ДокументыФизическихЛиц.ДатаВыдачи,"ДФ=dd.MM.yyyy"); 
				КонецЕсли;	
			КонецЕсли;	
			
			СтрокаТаблицы.Параметры.ТекстДокументы = ТекстДокументы;  
			
			СтрокаТаблицы.Параметры.Примечание = ?(ДанныеСотрудников.ОтношениеКВоинскомуУчету = Перечисления.ОтношениеКВоинскомуУчету.СнятПоВозрасту, "Виключено з військового обліку за віком", "");

			ДокументРезультат.Вывести(СтрокаТаблицы);      
		КонецЦикла;   
		Если ВыводитьОтветственных Тогда 
			ДокументРезультат.Вывести(Подвал);
		КонецЕсли;	
		ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЦикла;
	
КонецПроцедуры 

Функция ПараметрыЗаголовкаСтруктура(ДатаОтчета, Организация)
	
	ПараметрыЗаголовка = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Организация, "Наименование, НаименованиеПолное");
	
	ПолноеНаименованиеОрганизации = ?(ЗначениеЗаполнено(ПараметрыЗаголовка.НаименованиеПолное), ПараметрыЗаголовка.НаименованиеПолное, ПараметрыЗаголовка.Наименование);
	
	ПараметрыЗаголовка.Вставить("ДатаОтчета", ДатаОтчета);
	ПараметрыЗаголовка.Вставить("Организация", Организация);
	ПараметрыЗаголовка.Вставить("ПолноеНаименованиеОрганизации", ПолноеНаименованиеОрганизации);
	
	ЗаполнитьПодписантов(ПараметрыЗаголовка, Организация, ДатаОтчета);
	
	Возврат ПараметрыЗаголовка;
	
КонецФункции

Процедура ЗаполнитьПодписантов(ПараметрыЗаголовка, Организация, ДатаОтчета)
	
	ПараметрыЗаполнения = Новый Структура("Руководитель,РуководительРасшифровкаПодписи,ДолжностьРуководителя,ОтветственныйЗаВУР,ФИОРуководителя,"
		+ "ОтветственныйЗаВУРРасшифровкаПодписи,ДолжностьОтветственногоЗаВУР,ФИООтветственногоЗаВУР");

	КлючиОтветственныхЛиц = "";

	НастройкиОтчета = ЭтотОбъект.КомпоновщикНастроек.ПолучитьНастройки();
	
    ПараметрРуководитель = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Руководитель"));	
	Если ПараметрРуководитель <> Неопределено И ПараметрРуководитель.Использование Тогда
		Если ЗначениеЗаполнено(ПараметрРуководитель.Значение) Тогда
			ПараметрыЗаполнения.Руководитель = ПараметрРуководитель.Значение;
		КонецЕсли; 
	Иначе
		КлючиОтветственныхЛиц = "Руководитель";
	КонецЕсли;
	
	ПараметрДолжностьРуководителя = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДолжностьРуководителя"));	
	Если ПараметрДолжностьРуководителя <> Неопределено И ПараметрДолжностьРуководителя.Использование Тогда
		ПараметрыЗаполнения.ДолжностьРуководителя = ПараметрДолжностьРуководителя.Значение;
	Иначе
		КлючиОтветственныхЛиц = ?(ПустаяСтрока(КлючиОтветственныхЛиц), "", КлючиОтветственныхЛиц + ",") + "ДолжностьРуководителяСтрокой";
	КонецЕсли;
	
	ПараметрОтветственныйЗаВУР = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ОтветственныйЗаВУР"));	
	Если ПараметрОтветственныйЗаВУР <> Неопределено И ПараметрОтветственныйЗаВУР.Использование Тогда
		Если ЗначениеЗаполнено(ПараметрОтветственныйЗаВУР.Значение) Тогда
			ПараметрыЗаполнения.ОтветственныйЗаВУР = ПараметрОтветственныйЗаВУР.Значение;
		КонецЕсли; 
	Иначе
		КлючиОтветственныхЛиц = ?(ПустаяСтрока(КлючиОтветственныхЛиц), "", КлючиОтветственныхЛиц + ",") + "ОтветственныйЗаВУР";
	КонецЕсли;
	
	ПараметрДолжностьОтветственногоЗаВУР = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДолжностьОтветственногоЗаВУР"));	
	Если ПараметрДолжностьОтветственногоЗаВУР <> Неопределено И ПараметрДолжностьОтветственногоЗаВУР.Использование Тогда
		ПараметрыЗаполнения.ДолжностьОтветственногоЗаВУР = ПараметрДолжностьОтветственногоЗаВУР.Значение;
	Иначе
		КлючиОтветственныхЛиц = ?(ПустаяСтрока(КлючиОтветственныхЛиц), "", КлючиОтветственныхЛиц + ",") + "ДолжностьОтветственногоЗаВУРСтрокой";
	КонецЕсли;
	
	Если Не ПустаяСтрока(КлючиОтветственныхЛиц) Тогда
		
		ОтветственныеЛица = Новый Структура("Организация," + КлючиОтветственныхЛиц, Организация);
		ЗарплатаКадры.ПолучитьЗначенияПоУмолчанию(ОтветственныеЛица, ДатаОтчета);
		
		ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, ОтветственныеЛица);
		Если ОтветственныеЛица.Свойство("ДолжностьРуководителяСтрокой") И ЗначениеЗаполнено(ОтветственныеЛица.ДолжностьРуководителяСтрокой) Тогда
			ПараметрыЗаполнения.ДолжностьРуководителя = ОтветственныеЛица.ДолжностьРуководителяСтрокой;
		КонецЕсли;
		Если ОтветственныеЛица.Свойство("ДолжностьОтветственногоЗаВУРСтрокой") И ЗначениеЗаполнено(ОтветственныеЛица.ДолжностьОтветственногоЗаВУРСтрокой) Тогда
			ПараметрыЗаполнения.ДолжностьОтветственногоЗаВУР = ОтветственныеЛица.ДолжностьОтветственногоЗаВУРСтрокой;
		КонецЕсли; 
		
	КонецЕсли; 
	
	МассивФизЛиц = Новый Массив;
	Если ЗначениеЗаполнено(ПараметрыЗаполнения.Руководитель) Тогда
		МассивФизЛиц.Добавить(ПараметрыЗаполнения.Руководитель);
	КонецЕсли; 
	Если ЗначениеЗаполнено(ПараметрыЗаполнения.ОтветственныйЗаВУР) Тогда
		МассивФизЛиц.Добавить(ПараметрыЗаполнения.ОтветственныйЗаВУР);
	КонецЕсли; 
	
	Если МассивФизЛиц.Количество() > 0 Тогда
		
		ФИОФизЛиц = ЗарплатаКадры.СоответствиеФИОФизЛицСсылкам(ДатаОтчета, МассивФизЛиц);
		
		ФИОРуководителя = ФИОФизЛиц[ПараметрыЗаполнения.Руководитель];
		Если ЗначениеЗаполнено(ФИОРуководителя) Тогда
			ПараметрыЗаполнения.РуководительРасшифровкаПодписи = ФизическиеЛицаЗарплатаКадры.РасшифровкаПодписи(ФИОРуководителя);
			ПараметрыЗаполнения.ФИОРуководителя = ФИОРуководителя.Фамилия + " " + ФИОРуководителя.Имя + " " + ФИОРуководителя.Отчество;
		КонецЕсли; 

		ФИООтветственногоЗаВУР = ФИОФизЛиц[ПараметрыЗаполнения.ОтветственныйЗаВУР];
		Если ЗначениеЗаполнено(ФИООтветственногоЗаВУР) Тогда
			ПараметрыЗаполнения.ОтветственныйЗаВУРРасшифровкаПодписи = ФизическиеЛицаЗарплатаКадры.РасшифровкаПодписи(ФИООтветственногоЗаВУР);
			ПараметрыЗаполнения.ФИООтветственногоЗаВУР = ФИООтветственногоЗаВУР.Фамилия + " " + ФИООтветственногоЗаВУР.Имя + " " + ФИООтветственногоЗаВУР.Отчество;
		КонецЕсли; 

	КонецЕсли; 
	
	Для каждого КлючИЗначение Из ПараметрыЗаполнения Цикл
		ПараметрыЗаголовка.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;      
	
КонецПроцедуры

#КонецОбласти


#КонецЕсли
